---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewExportedEventArgs.ViewId
source: html/3f63bfcc-a969-159f-93e7-377c49abcdd5.htm
---
# Autodesk.Revit.DB.Events.ViewExportedEventArgs.ViewId Property

Identifies the view that was exported.

## Syntax (C#)
```csharp
public ElementId ViewId { get; }
```